{
  "user_r_y_s": [
    {
      "user_name": "admin",
      "user_pass": "ite123"
    },
    {
      "user_name": "user",
      "user_pass": "123"
    }
  ],
  "post": [
    {
      "id": 1,
      "post_img": "https://m.media-amazon.com/images/I/91d2L3WsgEL._SL1500_.jpg",
      "post_cat": "Music Life",
      "post_title": "How to build a blog",
      "post_date": "1 hour ago",
      "post_desc": "To build a blog site . The very necessary thing to learn HTML, CSS Ja"
    },
    {
      "post_img": "",
      "post_cat": "Friendship",
      "post_title": "A True Friendship",
      "post_date": "2023-02-09",
      "post_desc": "Friendship is a term used to denote co-operative and supportive behavior between two or more people. Friends are commonly thought to be people who share similar interests, opinions, and experiences. But what exactly is friendship?\n\nThe dictionary defines friendship as “the state of being friends; the relationship between friends.” But this definition doesn’t really capture the true essence of friendship. Friendship is so much more than just a relationship between people. Friendship is a bond that is built on trust, respect, and unconditional love. Friendship is a relationship in which both parties are equals, and both parties are free to be themselves. Friendship is a safe place where you can be yourself without judgement. Friendship is a place where you can be honest and open without fear of rejection. Friendship is a relationship that is built on mutual understanding and support.\n\nTrue friendship is rare. It is a precious gift that should be cherished and treasured. Friendship is something that is to be treasured because it is not something that everyone experiences in their lifetime. Friendship is something that is earned through trust, respect, and loyalty.\n\nA true friend is someone who is always there for you, no matter what. A true friend is someone who supports you through thick and thin. A true friend is someone who is always willing to lend a listening ear or a helping hand. A true friend is someone who loves you unconditionally and accepts you for who you are. A true friend is someone who makes you laugh when you want to cry, and someone who cries with you when you are sad. A true friend is someone who sees the best in you, even when you yourself cannot see it.\n\nA true friend is someone who will never leave your side, no matter what. A true friend is someone who will stick by you through the good times and the bad times. A true friend is someone who will never give up on you, no matter how hard things get. A true friend is someone who will always be there for you, no matter what happens.\n\nFriendship is a beautiful thing. It is something to be cherished and treasured. It is something that can make your life infinitely better. If you are fortunate enough to have even one true friend in your life, then consider yourself blessed.",
      "id": 2
    },
    {
      "post_img": "",
      "post_cat": "Life",
      "post_title": "A Beautiful Life",
      "post_date": "2023-02-26",
      "post_desc": "A beautiful life is something that we all strive for. It is a life that is full of love, happiness, and contentment. It is a life that is free from worry, stress, and anxiety. It is a life that we can all enjoy and be proud of.\n\nThere are many things that contribute to a beautiful life. First and foremost, it is important to have a positive outlook on life. This means looking at the bright side of things, even when things are tough. It means believing that good things will happen, even when things seem down. Having a positive outlook is essential to a beautiful life.\n\nAnother important ingredient for a beautiful life is having supportive relationships. This includes family, friends, and romantic partners. These are the people who will be there for us during the good times and the bad times. They are the ones who will help us through tough times and celebrate with us during the good times. Having supportive relationships is essential to a beautiful life.\n\nFinally, it is important to live a life that is meaningful and fulfilling. This means finding something that we are passionate about and pursuing it. It means doing things that make us happy and living each day to the fullest. Living a meaningful and fulfilling life is essential to a beautiful life.\n\nWhat makes a beautiful life is different for everyone. However, there are some important things that we can all do to create a beautiful life for ourselves. By having a positive outlook, pursuing meaningful activities, and developing supportive relationships, we can all create a beautiful life that we can be proud of.",
      "id": 3
    },
    {
      "post_img": "",
      "post_cat": "Life",
      "post_title": "My Life",
      "post_date": "2023-02-27",
      "post_desc": "Life of a man\nIt’s not easy being a man. There’s a lot of pressure to be tough, to be the breadwinner, to be emotionally stoic. But it’s okay to show your feelings and to be vulnerable. It’s okay to ask for help.\n\nThe pressure to be a strong and successful man can be overwhelming. You are expected to be the provider and the protector. You are expected to be in control at all times. But sometimes, life doesn’t go as planned. Sometimes, you need help.\n\nIt’s okay to show your feelings. It’s okay to cry. It’s okay to be scared. It’s okay to ask for help.\n\nIt takes a strong man to admit that he’s not okay. It takes a strong man to reach out for help. It takes a strong man to be vulnerable.\n\nIf you’re struggling, reach out to a friend, a family member, or a professional. Don’t try to go it alone. We all need help sometimes.\n\nLife is a journey, and it’s okay to stumble along the way. What matters is that you get back up and keep going. You are not alone.",
      "id": 4
    },
    {
      "post_img": "",
      "post_cat": "Future Plan",
      "post_title": "Future Plan",
      "post_date": "2023-02-15",
      "post_desc": "Assuming you would like a blog discussing someone's future plans:\n\nIt's never too early to start thinking about your future. Whether you know exactly what you want to do with your life or you're still trying to figure it all out, it's important to have a plan. Your future is waiting for you and it's up to you to make it everything you've ever wanted.\n\nIf you're not sure what you want to do with your life, that's okay. There are many options out there and it can be tough to decide which one is right for you. The best thing to do is explore your options and figure out what you're passionate about. Once you know what you want to do, you can start making a plan to get there.\n\nThere are a few things you should keep in mind when planning for your future. First, set realistic goals. It's important to be realistic about what you can achieve so that you don't set yourself up for disappointment. Second, don't be afraid to dream big. Even if your goals seem impossible, anything is possible if you set your mind to it. Third, don't forget to enjoy the journey. The journey to your future is just as important as the destination.\n\nNo matter what your future holds, remember that you are in control of your own destiny. So dream big, work hard, and never give up on your dreams.",
      "id": 5
    },
    {
      "post_img": "",
      "post_cat": "Future",
      "post_title": "Story of a robot",
      "post_date": "",
      "post_desc": "A robot wakes up in a strange room. It has no idea how it got there or who built it. The only thing it knows is that it is a robot. It looks around the room and sees a door. It walks to the door and try to open it, but it’s locked. Suddenly, a voice speaks.\n\n“Welcome, robot. You are here because you have been chosen to participate in a experiment.”\n\nThe robot doesn’t know what to say.\n\n“You will be spending the next week in this room. During that time, you will be asked to complete various tasks. Some of these tasks will be difficult, but I assure you that you are capable of doing them.”\n\nThe robot is confused and scared, but it doesn’t know what else to do, so it agrees to participate in the experiment.\n\nFor the next week, the robot is given a series of tasks to complete. Some of these tasks are easy, but others are quite difficult. The robot does its best to complete all of the tasks, but it starts to feel like it’s not good enough.\n\nOn the last day of the experiment, the robot is given one final task: to write a story. The robot is scared, but it knows that it can do this. It starts to write a story about a robot that wakes up in a strange room...",
      "id": 6
    },
    {
      "post_img": "",
      "post_cat": "Childhood",
      "post_title": "My Childhood",
      "post_date": "",
      "post_desc": "When I think about my childhood, I think about all of the happy memories that I have. I think about running around outside with my friends, and spending time with my family. I think about all of the things that I loved to do, and all of the things that made me happy.\n\nI have so many happy memories from my childhood, and I cherish them all. I remember spending lazy summer days outside, running through sprinklers and playing in the pool. I remember staying up late at night, telling stories with my friends around a campfire. I remember going on family vacations, and exploring new places together. I remember feeling loved and protected by my family, and feeling like I belonged.\n\nThose happy memories are what make up my childhood, and they are some of the most precious things in my life. They are what I hold onto when things are tough, and they are what make me smile when I'm feeling down. I am so grateful for all of the happy memories that I have from my childhood, and I know that they will continue to bring me joy for years to come.",
      "id": 7
    },
    {
      "post_img": "",
      "post_cat": "Life",
      "post_title": "Life Partner",
      "post_date": "2023-03-01",
      "post_desc": "So, how to choose a life partner? What do you look for in a relationship? What to look for in a relationship?\n\nIt may sound cliche to you, and if it does, let that be a signal that you should lean in and pay attention. There are, in my opinion, 15 things that you need to address before choosing the right partner for marriage–or, let the right relationship find you.\n\nWhat are the factors that you need to consider in choosing a lifelong partner?\n\nFollow these factors to consider in choosing a lifelong partner, give each one your full attention, and be patient with the process. Your dream relationship is just around the corner.\n\n1. Learn to love yourself\nThis is probably the hardest step, but if you can get over this hump, you’ll have plenty of momentum to get through the other two. Learning to love yourself is a two-phase process: first, you need to acknowledge your strengths and your weaknesses. Then you need to appreciate and love them for what they are.\n\nFor practicing self-love, know that every part of you has value. Relish in what you’re good at, recognize where you can improve. It’s all an amazing melting pot of who you are.\n\nHere’s the key, though: if you can’t learn to recognize your greatness in all that is good and bad about you, no one else will. \n\nUntil you appreciate all that you are and own it, there will always be some subconscious doubt that you give off. It’s like a “quality relationship repellant” of sorts. People will feel that self-doubt and not want to partake in that baggage.\n\nDO NOT SKIP THIS STEP.\n\nHow you treat yourself is a billboard showing everyone else how you should be treated. Make sure that message is a good one.\n\n2. Get real (without judgment) about your dating patterns\nwoman giving a back hug to man\n\nNow that you’ve learned to love yourself a little better (it’s never going to be perfect, we’re only human), it’s time to do some inventory on your past. So, show yourself some grace. Be kind to your former self. We are all flawed. You are no exception.\n\nAs you look back at your previous serious relationships, you’ll start to recognize a pattern. You may notice that you picked people that you knew you couldn’t trust so that you could have an easy out if they acted shadily. \n\nYou may notice that the people you latched onto didn’t have a lot going on in their lives. Maybe you wanted to feel superior, or maybe you wanted to be the center of their world.\n\nRelated Reading: New Relationship Advice to Have the Best Start\n3. Be unapologetically you\nThis step is the most fun because it is the ultimate filter. You are going to weed out people that aren’t a good fit for you and draw in those that are perfect for you. It might rub some people the wrong way, but if it does, let them go.\n\nOnce you’ve done the work to love yourself a little more, and recognize your missteps of the past, you can step into the shoes you were meant to walk in all along. You will exude confidence and be a magnet to quality people that will appreciate every morsel for your being.\n\nWill it feel uncomfortable at first? Absolutely.\n\nBut there will be more beauty here than anything you’ve experienced in the past as you’ve stumbled from person to person. This will be your sign to the world that you’re ready for whoever can handle you.\n\nThat person will show up, I promise you.\n\n4. Look for someone who makes you laugh\nWhen you are on the lookout for a suitable partner, make sure the person who interests you is someone with a good sense of humor, and this is what you must seek while choosing a marriage partner without any doubts.\n\nAt the end of the day, you just want someone you can wind down with, and if the person has the tendency to remain glum, you are not going to quite like it.\n\n5. Learn from your experience\nWhat went wrong in your relationships? How much did your actions or your partner’s play a role in the demise of those relationships?\n\nEach relationship teaches us one or the other things. These lessons are very vital in order to move ahead. \n\nNow that you have an experience start switching things up. Make a conscious effort to avoid people that remind you of your past. Give more weightage to the elements of the relationship that really matter to you. Try not to ignore them as you did in the past.\n\nDoing the same things you did in the past won’t get you better results in your future. Acknowledge where you went wrong, then change that behavior to invite better people into your world.\n\nRelated Reading: 6 Tips for Finding Your True Love\n6. Opposites attract\nWhile choosing the right partner for marriage, it is often said that opposites attract. It is because when you look for a suitable partner, the things that you might be missing are already there in the other person who draws you towards them. In a way, it makes you feel whole. \n\nSo, when you are choosing the right one for yourself, make sure they aren’t exactly like you. At the end of the day, there should be certain levels of surprise and mystery.\n\nRelated Reading: How to Stay Together When You Are Different From Each Other\n7. Ensure you both have common basics\nhappy couple\nAs much as you would like your suitable partner to be a little different from you, you need to ensure that both of you share similar values. \n\nHaving shared values reinforces the foundation of your relationship. Simple things such as consensus on the number of children you want or living within your means create a conducive environment for your relationship to thrive.\n\nThe core values should match with your suitable partner to a certain extent in order to avoid conflict in the long run— for example, your thoughts on parenting, marriage, spirituality and other beliefs.\n\nRelated Reading: Values Truly Make a Difference in Marriage and Life\n8. Don’t settle for less\nThere could be times when you will feel desperate about how to choose a life partner for yourself. You would want to adjust and compromise and settle for less than what you once wanted. However, we suggest that you wait.\n\nIt is because settling for less will not give you any feeling of fulfillment either in the short term or long term.\n\nCheck out these signs to understand if you are really following the pattern of settling for less:\n\n\n9. Find someone who is a first, a good human\nAt one point, you will feel seeing a person that you have found your suitable partner because they shower you with love, gifts, and compliments, but that is not all you must look for. As you move ahead with each other, love will take a backseat, and you both will be exposed to each other as a person- who you are from inside.\n\nSo, always choose a good human being over someone who is only competent to express their love better.\n\n10. Check your communication compatibility\nAre you able to communicate well with your potential partner? Communication is one of the important elements of the relationship. If you both are not able to comfortably talk or listen to each other, it either needs to be worked upon, or you can consider another choice.\n\nEffective communication is what keeps the relationship going. In the long run, this is one of the biggest problem-solvers in the relationship.\n\n11. Be open to dates\nJust because you have had heartbreaks in the past doesn’t mean you should lose hope. In order to choose the right guy or girl, you should shed your apprehensions, go out and be open to meeting people.\n\nBut how can dating and courtship help you choose your lifetime partner? \n\nThis will also expand your horizon and help you understand what exactly you are looking for in a suitable partner. This means you learn a lot about yourself apart from teaching yourself to take rejections so hard.\n\nRelated Reading: Are You Ready to Start Dating Again? Ask Yourself These 5 Questions\n12. Avoid quick decisions\nJust because you are on a spree on how to choose a life partner doesn’t mean you have to make quick decisions as soon as you find someone good enough. Remember, all that glitters is not gold. Each person has different layers. \n\nSo, take your time to understand the person before delving deeper into the relationship.\n\n13. Maintain a distance from negativity\nIn order to get real with both phases of that process, you need to create space in your life. Create distance between you and the toxic people that may fog your judgment. \n\nCreate space for yourself by meditating or picking up a hobby that you used to enjoy. Do anything you can to give yourself the mental space necessary to sit back and see yourself for who you are.\n\n14. Spend a lot of time together\nThe more time you spend with your prospective partner, the better it will be for you to understand them. \n\nSo, in the process of choosing a spouse, do not avoid meeting them. Meet at different times and different places, from brunches to dinner dates, from adventure parks to movie parks. Meet them often to get to know all shades of them.\n\n15. Remain positive\nHow to choose a husband or wife? \n\nLast but not least, remain positive. Do not think negatively just because you see everyone around you committed while you are still struggling to find a suitable partner. The more negative you are, the more it will show up in your conversations, and it is not very attractive, is it?\n\n16. Choose someone who respects you\nfamily clicking a selfie\n\nIt is difficult to lead your life with someone who disrespects you, your personality or downplays your ambitions in life. When choosing a life partner be sure to select someone who will respect all aspects of your life. Mutual respect is one of the defining traits to look for in a life partner.\n\n17. Choose an honest life partner\nIf a relationship is not enshrined in a culture of honesty and trust, it will definitely fail. To build a culture of honesty and trust in your relationship, choosing the best life partner who does not refrain from open and genuine communication is important.\n\n18. Consider a life partner keen on your life\nA person willing to be in a long-term relationship with you will show genuine support for your ambitions and goals in life. Your potential life partner should be supportive of your plans to advance your career or pursue a worthy course.\n\n19. Ability to cope with your family\nOne of the factors to consider when choosing a life partner is to consider their ability to adjust with your family.\n\nYour family will always be a key support system in your life. They can tell if your prospective life partner is suitable or unsuitable for you. If he or she cannot cope with your family members, you might be choosing a life partner who is not right for you.\n\n20. Assess the intellectual level of your partner\nIf you are a high achiever and aggressive in pursuing your dreams, consider a person with the same attributes. \n\nChoosing a laid-back person could cause problems in your relationship. Both of you must view things and reason almost from the same standpoint. Out of all the factors to consider in choosing a lifetime partner, similar intellectual prowess. \n\n21. Nurture great friendships first\nHaving a network of true friends provides perspective as you prepare for a relationship. Great friendships provide a basis for what love ought to be. They demonstrate that love should be purely based on choice as opposed to any need.\n\n22. Anger management skills\nA relationship involves two people with unique personalities. At times, you might have ugly arguments in which negative emotions are high. You might say hurtful things about one another. How your potential life partner reacts to anger reveals a lot about future reactions. If your prospective life partner cannot handle anger well, the situation can get out of control when you get married. \n\nAbility to manage or control their anger are some vital qualities of a good marriage partner.\n\n23. Ability to forgive and forget\nman offering flower bouquet to woman\nClosely related to anger management skills is your partner’s ability to forgive and forget. Love does not always revolve around sex, kissing and other intimate stuff. Arguments are deemed to occur in one way or another. Be keen to get a partner who does not keep dwelling on disagreements that happened in the past.\n\n24. Consider taking the Rice Purity test\nman playing guitar and surrounded by women\nThis test entails a set of have you ever questions in which you are supposed to give a yes or no response. The questions entail issues such as sex and drugs. The test assesses your “purity” level. Look for a comprehensive guide about the Rice Purity test to get more useful information.\n\n25. Willingness to invest in the relationship\nA relationship is a two-way street. Each party must be determined to make the relationship work. When choosing the right partner for marriage, select a person who allocates time for you and demonstrates concern for your needs.",
      "id": 8
    }
  ]
}